In [1]:
#[Assignment_01] Basic's

In [2]:
# Data types 
# Types of Variable
counter = 100.00 #float type variable inc decimal 
miles = 100 #integer type variable 
name = "Mehvish" #string type variable

#Printing variable using print function
print (counter)
print (miles)
print (name)

100.0
100
Mehvish

In [3]:
#Numbers
2 #integer value

2

In [4]:
2+3 #integer addition

5

In [5]:
2.3+5.5 #addition of float type variable

7.8

In [6]:
2**2 #exponent

4

In [7]:
#stings variable 
name = 'Mehvish'
university = "COMSATS" 
# storing name and university in a variable

print(name,university) #printing name and university using print funtion

Mehvish COMSATS

In [8]:
#updating string
stringVariable = "Hello World" #storing orginal string
stringVariable = stringVariable[:6] + "Python" # replacing part using + operator

print("Updated string:",stringVariable)

Updated string: Hello Python

In [9]:
#delete String
stringVariable = "Hello World"
print(stringVariable) #prints the string
del stringVariable    #deletes the variable from memory
print(stringVariable) #variable no longer exists, it will give NameError.

Hello World

NameError: name 'stringVariable' is not defined

In [10]:
#fixing Error
stringVariable = "Hello World" #redefining the variable
print(stringVariable) # printing string

Hello World

In [11]:
#String special operators 
variable = "Hello" #storing string in a variable
print(variable+"Python") # '+' operator used for concatenation

HelloPython

In [12]:
variable = "Hello"
print(variable*3) #printing,'*' operator used for repetition

HelloHelloHello

In [13]:
variable = "Hello"
print(variable[1]) #printing character at index 1 by using the '[]' operator

e

In [14]:
variable = "Hello"
print(variable[1:3]) # printing characters at index 1 and 2 usingg'[:]' slicing operator'

el

In [15]:
variable = "Hello" 
print('H'in variable) # 'in' checks whether 'H' exists in the string

True

In [16]:
#string formatting operator
print ("My name is %s and age is %d! kg" % ("Zara",21))

My name is Zara and age is 21! kg

In [17]:
#Lists
list1 = ['Mehvish','1880']
print(list1)

['Mehvish', '1880']

In [18]:
#accessing values in lists
list1 = ['physics','chemistry',1997,2000]; # list of string and integer
list2 = [1,2,3,4,5,6,7];

print("list1[0]: ",list1[0])
print("list2[1:5]: ",list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

In [19]:
#updating lists
list1 =['physics','chemistry',1997,2000];
list1[1] ="computer science"
print(list1)

list1.append('Computer Science') #updating
print(list1)

['physics', 'computer science', 1997, 2000]
['physics', 'computer science', 1997, 2000, 'Computer Science']

In [20]:
list1 =['physics','chemistry',1997,2000];
print (list1)

del list1[2]; #delete list element [2] which is 1997. 

print("After deleting value at index 2 : ")
print(list1) #list after deletion of element

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 'chemistry', 2000]

In [21]:
list1 =['physics','chemistry',1997,2000];
print (list1)

list1.remove('chemistry') #remove function used 
print ("After deleting value at index 2 : ")
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 1997, 2000]

In [22]:
#dictionaries 'dict' used to store data, shown by the example below
dict = {'Name': "Mehvish",'Depart': "BCS", 'Batch': 2014}
print (dict['Name'])

Mehvish

In [23]:
# dictionary can be updated, shown below
dict = {'Name': "Mehvish",'Depart':"BCS", 'Batch' : 2014}
print (dict)
dict['Batch'] = "SP14" #updating existing value
print (dict)

dict['University'] = "COMSATS" #adding new entry 
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14'}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14', 'University': 'COMSATS'}

In [24]:
dict = {'Name': "Mehvish",'Depart':"BCS", 'Batch' : 2014}
print (dict)

del dict['Batch'] #delete dictionary element 'Batch'
print (dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS'}

In [25]:
#Tuples
tup = ( 'Math', '98', 'C programming','99')
print (tup)

print(tup[1])
print(tup[1:3]) #print function used to print  elements at index [1:3]

('Math', '98', 'C programming', '99')
98
('98', 'C programming')

In [26]:
tup1 = (12,34.56); 
tup2 = ('abc','xyz'); 

#Following action is not valid for tuples 
#tup1[0] = 100
#So let's create a new tuple as follows 
tup3 = tup1 + tup2
print (tup3);

(12, 34.56, 'abc', 'xyz')

In [27]:
up = ('physics', 'chemistry', 1997,2000); 
print (tup); 
del tup;
print ("After deleting tup : ");
print (tup);

#Name error will come up due to 'del tup' as it removed the tuple entirely.

tup = ('physics', 'chemistry', 1997, 2000)
print(tup)
del tup
print("After deleting tup : ")

('Math', '98', 'C programming', '99')
After deleting tup :

NameError: name 'tup' is not defined

In [ ]:
#Sets
#lists
list1 = [1,2,3,4,5]

print (type(list1))

my_set = set(list1)

print(my_set) 
print(type(my_set))

#set of integers
my_set = {1,2,3}
print (my_set)

#set of mixed data type 
my_set = {1,"Hello",1.2,'C'}
#adding a single value / item
my_set.add('D') 
#adding multiple values
my_set.update(list1)
print(my_set)

my_set.discard('G') #will not raise error as it is used remove something quietly without any feedback.
my_set.remove('G') #it will raise 'key error' if 'G' is not found

In [ ]:
#Comparision Operators
1<3 #gives result in boolean 'true / false'

In [ ]:
15 <= 23

In [28]:
'Mehvish' == "Zeenat"

False

In [29]:
"Mehvish" != "Mehvish"

False

In [30]:
(1==1)or(5>2)

True

In [31]:
(1<2)and(2<1)

False

In [32]:
# IF Else Statements
#if-else statement 
if 25 % 2: 
    print('Even')
else:
    print ('Odd')

Even

In [33]:
#For and while Loop
#example of for loop
fact = 1 
N = 5 #finding the factorial of 5
for i in range (1,N+1): #loop from 1 to 5
    fact*=i

print (fact)

120

In [34]:
#example of while loop 
a = 0 
while a < 10:
    a = a+1
    print (a)

1
2
3
4
5
6
7
8
9
10

In [35]:
# Function definition is here
def printme(str): 
    # This prints a passed string into this function 
    print(str) 
    return   #

# Now you can call printme function 
printme("I'm first call to user defined function!")

I'm first call to user defined function!

In [36]:
#lambda functions
#normal function 
def f (x):
    return x**2 #normal function have return statment 
print (f(8))

64

In [37]:
#lambda Function
#lambda expression
times3 = lambda var:var*3 #creates a function that multiplies input by 3
times3 (10) # runs the funtion with 10 as input

30

In [38]:
#Map () funtion used with two arguments; name of the funtion and sequence

sentence = 'It is raining cats and dogs' 
word = sentence.split() # use of split function to split words from the sentence
print (word)

lengths = map(lambda word: len(word), word) #map applies lambda function to each item in word
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

In [39]:
#Filter()
fib = [0,1,1,2,3,5,8,13,21,34,55] # list of fibbonacci numbers
result1 = filter(lambda x: x% 2,fib) # filter() will keep only the elements for which the lambda returns True

list(result1)

[1, 1, 3, 5, 13, 21, 55]

In [40]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result2 = filter(lambda x: x % 2 == 0,fib)
list (result2)

[0, 2, 8, 34]

In [41]:
#File I/O
from six.moves import input
string = input("Enter your name: "); #prompts the user to enter their name, stores it in the variable as `string`
print(string)

Enter your name:  Mevish

Mevish

In [42]:
#I/O from ot to Text File

fileOpen = open("file.txt", "w")  # 'w' mode creates or overwrites the file
fileOpen.write("Name: Mehvish Ashiq\nDepartment: BSCS")
fileOpen.close()

In [43]:
fileOpen = open("file.txt", "r+")
str = fileOpen.read()  #to read specific content from start you can use read(12). It will read 12 characters from the start of file
print(str)
fileOpen.close()

Name: Mehvish Ashiq
Department: BSCS

In [44]:
# Open a file to append 
#a+ opens file in append and read mode
fileOpen = open("file.txt", "a+") 
fileOpen.write(" Information Technology Lahore"); 
fileOpen.close() 
# Open a file to read using 'r+'
fileOpen = open("file.txt", "r+") 
string = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file 
print (string) 
# Close opend file 
fileOpen.close()

Name: Mehvish Ashiq
Department: BSCS Information Technology Lahore

In [45]:
# Open a file using 'r+' (read & write mode)
fo = open("file.txt", "r+")

# Read the first 10 characters
str = fo.read(10)
print("Read String is:\n", str)
# Check current position using 'tell()'
position = fo.tell()
print("Current file position:\n", position)
# Reposition pointer at the beginning using 'seek(0, 0)'
fo.seek(0, 0)
# Read again from the beginning
str = fo.read(10)
print("Again read String is:\n", str)
# Close opened file
fo.close()

Read String is:
 Name: Mehv
Current file position:
 10
Again read String is:
 Name: Mehv

In [46]:
import os
# renameafile
os.rename("file.txt","newfile.txt")

In [47]:
#remove file 
os.remove("newfile.txt")

In [48]:
# Series
# From ndarray 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

"""following a fucntion is called from pandas to create a series. 
data would be 5 random values and indexes are assigned a-e"""

s = pd.Series(np.random.randn(5), index=['a','b','c','d','e'])
print(s)

a    0.965519
b   -0.763980
c   -0.322033
d   -1.662537
e    3.185136
dtype: float64

In [49]:
""" In following example, indexes are not given to it is constructed from the sorted keys of the dict""" 
d = {'a' : 0., 'b' : 1., 'c' : 2.} # a python dict
pd.Series(d) # Converts the dictionary into a pandas Series

a    0.0
b    1.0
c    2.0
dtype: float64

In [50]:
#from a scalar value 
""" In following example, index are given, so the values in data corresponding in the index will be pulled out.""" 
pd.Series(d, index=['b', 'c', 'd', 'a']) #creates a Series with a custom index list

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [51]:
"""In following example, a scalar value is given as data so it will be repeated to match the length of index"""
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])  #creates a series with scalar value 5.0 and 5 index labels

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [52]:
s[0]

C:\Users\H.H\AppData\Local\Temp\ipykernel_3192\243613605.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

np.float64(0.96551919138016)

In [53]:
#access range of values
s[:5]

a    0.965519
b   -0.763980
c   -0.322033
d   -1.662537
e    3.185136
dtype: float64

In [54]:
""" Following example will return a range of values in series whose value is greater than the median of serie 
s""" 
s[s > s.median()]

a    0.965519
e    3.185136
dtype: float64

In [55]:
"""Following example is return the values in series with indexes. 4,3,1 are the positions of the index
For example: the index at 4,3,1 are e,d,b respectively""" 
s[[4, 3, 1]]

C:\Users\H.H\AppData\Local\Temp\ipykernel_3192\2826670177.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[[4, 3, 1]]

e    3.185136
d   -1.662537
b   -0.763980
dtype: float64

In [56]:
""" Following example returns the exponent values. just like e^a (here a is index and its respective data is 
placed here)""" 
np.exp(s)

a     2.626151
b     0.465809
c     0.724674
d     0.189657
e    24.170578
dtype: float64

In [57]:
"""Following example will update the data of the given index""" 
s['e'] = 12. 
s # before updating e = 1.399281 but after updating e = 12.0000

a     0.965519
b    -0.763980
c    -0.322033
d    -1.662537
e    12.000000
dtype: float64

In [58]:
s['a']

np.float64(0.96551919138016)

In [59]:
"""Following example will update the data of the given index""" 
s['e'] = 12. 
s # before updating e = 1.399281 but after updating e = 12.0000

a     0.965519
b    -0.763980
c    -0.322033
d    -1.662537
e    12.000000
dtype: float64

In [60]:
""" Following will return true if 'e' is in the values of index otherwise false""" 
'e' in s  #gives result in boolean

True

In [61]:
"""If a label is not contained and you are trying to access its data, an exception is raised: """ 
s['f'] 
# This will create error because f is not in the given data

KeyError: 'f'

In [62]:
#to fix the above data
"""Using the get method, a missing label will return None or specified default""" 
s.get('f') #it will return none
s.get('f', np.nan) #it will return default value, instead of error it will return NaN

nan

In [63]:
#vectorized operations and label alignment with series
"""following will add the data of respective values of indexes. For example, in given output, it is calculated as:
 a = s['a'] +
 s['a'] b = s['b'] +
 s['b'] c = s['c'] +
 s['c'] d = s['d'] +
 s['d'] e = s['e'] +
 s['e'] 
""" 
s + s # element is added to itself based on matching index

a     1.931038
b    -1.527960
c    -0.644066
d    -3.325075
e    24.000000
dtype: float64

In [64]:
"""following will multiply the data of each values of indexes, with 2. For example, in given output, it is ca 
lculated as: 
a = s['a'] *2
b = s['b'] *2
c = s['c'] *2
d = s['d'] *2 
e = s['e'] *2""" 
s * 2  #element operation with scalar (2). each value is multiplied individually in the series

a     1.931038
b    -1.527960
c    -0.644066
d    -3.325075
e    24.000000
dtype: float64

In [65]:
s = pd.Series(np.random.randn(5), name='something') 
print(s)

0   -0.399036
1    0.182071
2   -0.610641
3   -0.436696
4    1.268261
Name: something, dtype: float64

In [66]:
#rename the series name attribute and assign to s2 object. Note that s and s2 refer to different objects. 
s2 = s.rename("different") 
s2.name

'different'

In [67]:
# DataFrames #from dict of Series or dicts 

""" A dict is created """
d = { 
'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
} 
df=pd.DataFrame(d) 
print(df)
"""create a dataframe. row label will be the indes of a series. As coloum labels are not given so it 
will be sorted list of dict keys"""

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

'create a dataframe. row label will be the indes of a series. As coloum labels are not given so it \nwill be sorted list of dict keys'

In [68]:
""" a data frame will be constructed for given row labels"""
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [69]:
"""following example shows a data frame when we give coloumn labels"""
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [70]:
df.columns

Index(['one', 'two'], dtype='object')

In [71]:
#from dict of ndarrays / lists
"""following examples shows that ndarray has same length"""
d = { 
'one' : [1., 2., 3., 4.],
'two' : [4., 3., 2., 1.] 
} 
"""column labels are not given so the result will be range(n), where n is the array length"""
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [72]:
"""if indexs are given then it would be same length as arrays"""
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [73]:
#from a list of dicts
"""constructing data frame from a list of dicts""" 
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [74]:
"""passing list of dicts as data and indexes (row labels)""" 
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [75]:
"""passing list of dicts as data and columns (columns labels)"""
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

In [76]:
#from a dict of tuples 
#creating a multiindexed frame by passing a tuples dictionary
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2}, 
('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
 ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
 ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
 ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

#NaN shows missing data

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

In [77]:
#Alternate constructors
#DataFrame.from_dict
#DataFrame.from_records

data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'S10')]) 
print(data)

[(0, 0., b'') (0, 0., b'')]

In [78]:
pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

In [79]:
#DataFrame.from_items
pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])])

AttributeError: type object 'DataFrame' has no attribute 'from_items'

In [80]:
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6]
}

df = pd.DataFrame(data)
print(df)
#from items not working

   A  B
0  1  4
1  2  5
2  3  6

In [81]:
df = pd.DataFrame.from_dict(data, orient='index', columns=['one', 'two', 'three'])
print(df)

   one  two  three
A    1    2      3
B    4    5      6

In [82]:
#Column selection, addition and deletion
df['one'] # it is displaying data under coloumn 'one'

A    1
B    4
Name: one, dtype: int64

In [83]:
df['three'] = df['one'] * df['two'] # assigning values to a colomn named 'three' after calculation

In [84]:
df['flag'] = df['one'] > 2 #check if value at column 'one' is > 2 then assign True otherwise false

In [85]:
print(df) #print a complete data frame

   one  two  three   flag
A    1    2      2  False
B    4    5     20   True

In [86]:
#delete a coloumn 'two' from data frame
del df['two']

In [87]:
three = df.pop('three') #pop a complete coloumn 'three' from dataframe

In [88]:
print(df)

   one   flag
A    1  False
B    4   True

In [89]:
df['foo'] = 'bar' #a coloumn 'foo' will be populated with 'bar'

In [90]:
print(df)

   one   flag  foo
A    1  False  bar
B    4   True  bar

In [91]:
"""following example will take values from coloumn one until give range and will populate the new coloumn"""
df['one_trunc'] = df['one'][:2]

In [92]:
print(df)

   one   flag  foo  one_trunc
A    1  False  bar          1
B    4   True  bar          4

In [93]:
"""following function has three arguments. 
First argument: index where new coloumn will be inserted. 
Second argument: label or title of a new coloumn 
Third argument: it will create a coloumn at specified position""" 

df.insert(1, 'bar2', df['one'])

In [94]:
print(df)

   one  bar2   flag  foo  one_trunc
A    1     1  False  bar          1
B    4     4   True  bar          4

In [96]:
#Indexing / Selection 
#returns a series whose index is the columns of the DataFrame
#df.loc['b'] returns all column labels and their values for the row with index label 'b'
df.loc['B']

one             4
bar2            4
flag         True
foo           bar
one_trunc       4
Name: B, dtype: object

In [99]:
df.iloc[0] #it will return the values of those coloumns that is > than 2

one              1
bar2             1
flag         False
foo            bar
one_trunc        1
Name: A, dtype: object

In [100]:
#Data alignment and arithmetic 
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D']) 
# creates a 10x4 dataframe 'df' with random numbers and columns A, B, C, D

In [101]:
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])
#creates a 7x3 dataframe 'df2' with random numbers and columns A, B, C,

In [102]:
df + df2 
# add values of respective coloumn labels

          A         B         C   D
0  0.576176  1.422908 -0.925818 NaN
1 -3.102608  0.293953 -2.471443 NaN
2 -0.023023  0.718679  1.790984 NaN
3 -1.219400  0.846741  1.757198 NaN
4  2.616473  1.002800  0.595028 NaN
5  0.329185 -1.563256  0.572948 NaN
6  0.892561 -0.919703  0.521583 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [104]:
df - df.iloc[0]  #subtract the first row from all rows

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -2.262125 -0.568452 -1.744268  1.392264
2 -1.232614 -1.129134 -1.232126  0.195111
3 -1.991537 -1.199224 -0.056969  0.080911
4 -0.818637  0.114890  0.163942 -0.979686
5 -0.254061 -2.919464 -0.534026 -1.058050
6 -1.609708 -4.027352 -0.637258 -0.729569
7 -2.610175 -1.922566  0.212069 -1.129340
8 -1.234067 -1.473088  0.476295 -2.306149
9  0.742314 -0.272517 -1.003003 -0.555052

In [105]:
df * 5 + 2  #multiplies every element in the 'df' by 5, then adds 2 to each result

          A          B         C          D
0  5.936993   8.775715  6.034179   5.484214
1 -5.373631   5.933453 -2.687161  12.445533
2 -0.226076   3.130044 -0.126451   6.459772
3 -4.020691   2.779594  5.749334   5.888769
4  1.843809   9.350165  6.853890   0.585783
5  4.666686  -5.821605  3.364048   0.193966
6 -2.111545 -11.361047  2.847890   1.836371
7 -7.113880  -0.837116  7.094524  -0.162483
8 -0.233342   1.410276  8.415653  -6.046529
9  9.648563   7.413132  1.019163   2.708953

In [106]:
1 / df # division of 1 by each value in the 'df'

           A         B         C          D
0   1.270005  0.737929  1.239410   1.435044
1  -0.678092  1.271148 -1.066744   0.478674
2  -2.246105  4.424605 -2.351335   1.121134
3  -0.830469  6.413598  1.333570   1.285754
4 -32.012154  0.680257  1.030102  -3.535525
5   1.874986 -0.639255  3.665561  -2.768497
6  -1.216088 -0.374222  5.896990 -30.556885
7  -0.548614 -1.762353  0.981446  -2.312156
8  -2.238798 -8.478541  0.779344  -0.621386
9   0.653718  0.923680 -5.097686   7.052650

In [107]:
df **4 # make each element to the power of 4

              A          B         C          D
0  3.843959e-01   3.372412  0.423780   0.235798
1  4.729831e+00   0.383015  0.772253  19.047696
2  3.928980e-02   0.002609  0.032715   0.632952
3  2.102351e+00   0.000591  0.316182   0.365905
4  9.522268e-07   4.669909  0.888136   0.006400
5  8.091098e-02   5.988298  0.005539   0.017023
6  4.572355e-01  50.989641  0.000827   0.000001
7  1.103909e+01   0.103664  1.077790   0.034989
8  3.980528e-02   0.000194  2.710712   6.707400
9  5.475697e+00   1.373772  0.001481   0.000404

In [108]:
#Boolean operators
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)

In [109]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

In [110]:
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool) #gives result in true / false

       a      b
0  False   True
1   True   True
2   True  False

In [111]:
df1 & df2 #and logical operator

       a      b
0  False  False
1  False   True
2   True  False

In [112]:
df1 | df2 # or operator

      a     b
0  True  True
1  True  True
2  True  True

In [113]:
-df1 #re

       a      b
0  False   True
1   True  False
2  False  False

In [114]:
# transposing 
# access the T attribute also the transpose function
# only show the first 5 rows
df[:5].T

          0         1         2         3         4
A  0.787399 -1.474726 -0.445215 -1.204138 -0.031238
B  1.355143  0.786691  0.226009  0.155919  1.470033
C  0.806836 -0.937432 -0.425290  0.749867  0.970778
D  0.696843  2.089107  0.891954  0.777754 -0.282843

In [115]:
#creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:
dates = pd.date_range('20130101', periods=6)

In [116]:
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [117]:
#Creates DataFrame with random numbers,indexed by `dates`, and columns 
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [118]:
print(df)

                   A         B         C         D
2013-01-01  0.179553  0.263283  0.500210  0.779059
2013-01-02  0.995978 -0.509828 -0.186148 -0.265221
2013-01-03 -0.866981 -0.130418  0.022491 -0.315984
2013-01-04  0.280158 -0.685520 -0.137423 -0.124859
2013-01-05 -0.498899 -0.127431 -0.358899  0.751689
2013-01-06 -0.705824  1.786893 -0.031778 -1.779740

In [119]:
#creating a DataFrame by passing a dict of objects that can be converted to series-like.
df2 = pd.DataFrame({ 'A' : 1., 
'B' : pd.Timestamp('20130102'),
'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
'D' : np.array([3] * 4,dtype='int32'),
'E' : pd.Categorical(["test","train","test","train"]),
'F' : 'foo' })  #creates a DataFrame with mixed data types including float,timestamp,series,numpy array,categorical and string

In [120]:
print(df2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [121]:
#Having specific dtypes 
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [122]:
#Viewing Data
df.head(5) #display first 5 records

                   A         B         C         D
2013-01-01  0.179553  0.263283  0.500210  0.779059
2013-01-02  0.995978 -0.509828 -0.186148 -0.265221
2013-01-03 -0.866981 -0.130418  0.022491 -0.315984
2013-01-04  0.280158 -0.685520 -0.137423 -0.124859
2013-01-05 -0.498899 -0.127431 -0.358899  0.751689

In [123]:
df.tail(3) #display last 3 records

                   A         B         C         D
2013-01-04  0.280158 -0.685520 -0.137423 -0.124859
2013-01-05 -0.498899 -0.127431 -0.358899  0.751689
2013-01-06 -0.705824  1.786893 -0.031778 -1.779740

In [124]:
df.index #display indexes

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [125]:
df.columns #display coloumns A,B,C,D

Index(['A', 'B', 'C', 'D'], dtype='object')

In [126]:
df.values # print values

array([[ 0.1795535 ,  0.26328267,  0.50021033,  0.77905934],
       [ 0.99597834, -0.50982785, -0.18614787, -0.26522076],
       [-0.86698145, -0.13041781,  0.0224913 , -0.31598362],
       [ 0.28015752, -0.68551975, -0.13742323, -0.1248591 ],
       [-0.49889909, -0.1274306 , -0.35889894,  0.75168915],
       [-0.7058236 ,  1.78689254, -0.03177755, -1.77973995]])

In [127]:
# Transposing your data 
df.T #make columns to rows and rows to column

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.179553    0.995978   -0.866981    0.280158   -0.498899   -0.705824
B    0.263283   -0.509828   -0.130418   -0.685520   -0.127431    1.786893
C    0.500210   -0.186148    0.022491   -0.137423   -0.358899   -0.031778
D    0.779059   -0.265221   -0.315984   -0.124859    0.751689   -1.779740

In [128]:
#Sorting the columns in descending order based on their labels.
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.779059  0.500210  0.263283  0.179553
2013-01-02 -0.265221 -0.186148 -0.509828  0.995978
2013-01-03 -0.315984  0.022491 -0.130418 -0.866981
2013-01-04 -0.124859 -0.137423 -0.685520  0.280158
2013-01-05  0.751689 -0.358899 -0.127431 -0.498899
2013-01-06 -1.779740 -0.031778  1.786893 -0.705824

In [129]:
#Sorts the rows in ascending order based on the values in column as B
df.sort_values(by='B')

                   A         B         C         D
2013-01-04  0.280158 -0.685520 -0.137423 -0.124859
2013-01-02  0.995978 -0.509828 -0.186148 -0.265221
2013-01-03 -0.866981 -0.130418  0.022491 -0.315984
2013-01-05 -0.498899 -0.127431 -0.358899  0.751689
2013-01-01  0.179553  0.263283  0.500210  0.779059
2013-01-06 -0.705824  1.786893 -0.031778 -1.779740

In [130]:
# Describe shows a quick statistic summary of your data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.102669  0.099497 -0.031924 -0.159176
std    0.712488  0.890619  0.292560  0.935222
min   -0.866981 -0.685520 -0.358899 -1.779740
25%   -0.654092 -0.414975 -0.173967 -0.303293
50%   -0.159673 -0.128924 -0.084600 -0.195040
75%    0.255007  0.165604  0.008924  0.532552
max    0.995978  1.786893  0.500210  0.779059

In [131]:
#Selecting a single column, which yields a Series, equivalent to df.A 
df['A']

2013-01-01    0.179553
2013-01-02    0.995978
2013-01-03   -0.866981
2013-01-04    0.280158
2013-01-05   -0.498899
2013-01-06   -0.705824
Freq: D, Name: A, dtype: float64

In [132]:
#Selecting via [], which slices the rows. 
df[0:3]

                   A         B         C         D
2013-01-01  0.179553  0.263283  0.500210  0.779059
2013-01-02  0.995978 -0.509828 -0.186148 -0.265221
2013-01-03 -0.866981 -0.130418  0.022491 -0.315984

In [133]:
#selects rows index label as data index is time based 
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.995978 -0.509828 -0.186148 -0.265221
2013-01-03 -0.866981 -0.130418  0.022491 -0.315984
2013-01-04  0.280158 -0.685520 -0.137423 -0.124859

In [135]:
#Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.179553  0.263283
2013-01-02  0.995978 -0.509828
2013-01-03 -0.866981 -0.130418
2013-01-04  0.280158 -0.685520
2013-01-05 -0.498899 -0.127431
2013-01-06 -0.705824  1.786893

In [136]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','B']] #df.loc used to select data.

                   A         B
2013-01-02  0.995978 -0.509828
2013-01-03 -0.866981 -0.130418
2013-01-04  0.280158 -0.685520

In [137]:
# Reduction in the dimensions of the returned object 
df.loc['20130102',['A','B']]

A    0.995978
B   -0.509828
Name: 2013-01-02 00:00:00, dtype: float64

In [138]:
# For getting a scalar value 
df.loc[dates[0],'A']

np.float64(0.17955349503977672)

In [139]:
#for getting fast access to a scalar 
df.at[dates[0],'A']

np.float64(0.17955349503977672)

In [140]:
#select via the position of the passed integers 
df.iloc[3]

A    0.280158
B   -0.685520
C   -0.137423
D   -0.124859
Name: 2013-01-04 00:00:00, dtype: float64

In [141]:
# By integer slices, acting similar to numpy/python 
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.280158 -0.685520
2013-01-05 -0.498899 -0.127431

In [142]:
#By lists of integer position locations, similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]  #select rows 1,2,4 and column 0,2

                   A         C
2013-01-02  0.995978 -0.186148
2013-01-03 -0.866981  0.022491
2013-01-05 -0.498899 -0.358899

In [143]:
# For slicing rows explicitly
df.iloc[:,1:3]

                   B         C
2013-01-01  0.263283  0.500210
2013-01-02 -0.509828 -0.186148
2013-01-03 -0.130418  0.022491
2013-01-04 -0.685520 -0.137423
2013-01-05 -0.127431 -0.358899
2013-01-06  1.786893 -0.031778

In [144]:
# For getting a value explicitly 
df.iloc[1,1]

np.float64(-0.5098278528050846)

In [145]:
# Using a single column’s values to select data.  
#returns all rows where the values in column A are greater than 0.
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.179553  0.263283  0.500210  0.779059
2013-01-02  0.995978 -0.509828 -0.186148 -0.265221
2013-01-04  0.280158 -0.685520 -0.137423 -0.124859

In [146]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2013-01-01  0.179553  0.263283  0.500210  0.779059
2013-01-02  0.995978       NaN       NaN       NaN
2013-01-03       NaN       NaN  0.022491       NaN
2013-01-04  0.280158       NaN       NaN       NaN
2013-01-05       NaN       NaN       NaN  0.751689
2013-01-06       NaN  1.786893       NaN       NaN

In [147]:
#Using the isin() method for filtering:
df2 = df.copy() #creates a deepcopy of df to df2which won't affect the orginal dataframe of df

In [148]:
df2['E'] = ['one', 'one','two','three','four','three']

In [149]:
print(df2)

                   A         B         C         D      E
2013-01-01  0.179553  0.263283  0.500210  0.779059    one
2013-01-02  0.995978 -0.509828 -0.186148 -0.265221    one
2013-01-03 -0.866981 -0.130418  0.022491 -0.315984    two
2013-01-04  0.280158 -0.685520 -0.137423 -0.124859  three
2013-01-05 -0.498899 -0.127431 -0.358899  0.751689   four
2013-01-06 -0.705824  1.786893 -0.031778 -1.779740  three

In [150]:
df2[df2['E'].isin(['two','four'])] #filtering

                   A         B         C         D     E
2013-01-03 -0.866981 -0.130418  0.022491 -0.315984   two
2013-01-05 -0.498899 -0.127431 -0.358899  0.751689  four